<?php

define('PREFECTURE', [
    0 => '',
    1 => '北海道',
    2 => '青森県',
    3 => '岩手県',
    4 => '宮城県',
    5 => '秋田県',
    6 => '山形県',
    7 => '福島県',
    8 => '茨城県',
    9 => '栃木県',
    10 => '群馬県',
    11 => '埼玉県',
    12 => '千葉県',
    13 => '東京都',
    14 => '神奈川県',
    15 => '新潟県',
    16 => '富山県',
    17 => '石川県',
    18 => '福井県',
    19 => '山梨県',
    20 => '長野県',
    21 => '岐阜県',
    22 => '静岡県',
    23 => '愛知県',
    24 => '三重県',
    25 => '滋賀県',
    26 => '京都府',
    27 => '大阪府',
    28 => '兵庫県',
    29 => '奈良県',
    30 => '和歌山県',
    31 => '鳥取県',
    32 => '島根県',
    33 => '岡山県',
    34 => '広島県',
    35 => '山口県',
    36 => '徳島県',
    37 => '香川県',
    38 => '愛媛県',
    39 => '高知県',
    40 => '福岡県',
    41 => '佐賀県',
    42 => '長崎県',
    43 => '熊本県',
    44 => '大分県',
    45 => '宮崎県',
    46 => '鹿児島県',
    47 => '沖縄県',
    48 => '海外',
]);

define('MAGAZINE', [
    0 => '受信しない',
    1 => '受信する',
]);

define('MAGAZINE_TYPE', [
    0 => 'PC',
    1 => 'モバイル',
]);

define('TRANSFER', [
    0 => '待機',
    1 => '転送済み',
]);

define('SUPPORT_CATEGORY', [
    0 => '使い方に関するお問い合わせ',
    1 => '不具合に関するお問い合わせ',
    2 => 'その他のお問い合わせ',
]);

define('SPOOL_STATUS', [
    0 => '無効',
    1 => '有効',
    2 => '削除',
]);

define('SPOOL_RESULT', [
    0 => '承認',
    1 => '却下',
]);

define('SPOOL_TYPE', [
    0 => '追加',
    1 => '更新',
    2 => '削除',
]);

define('IMPORT_EXPORT', [
    0 => 'インポート',
    1 => 'エクスポート',
]);

define('EXPORT_ENCODE', [
    0 => 'UTF-8 (標準)',
    1 => 'UTF-8 BOM 付き (Microsoft Excel (Windows))',
    2 => 'UTF-16 BOM 付き (Microsoft Excel (Mac))',
]);

define('ADMIN_LOGIN_STATUS', [
    0 => '無効',
    1 => '有効',
]);
